WMSGIFT/src/Catalogs/ПроизводственныеКалендари/ПроизводственныеКалендари.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственныеКалендари</name>
  <attributes>
    <name>БазовыйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
</mdclass:Catalog>

WMSGIFT/src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПроизводственногоКалендаря</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Catalogs/ПроизводственныеКалендари/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Год=Год(ТекущаяДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКалендаря(Команда)
	Если Параметры.Ключ.Пустая() Тогда 
		итWMSОбщегоНазначенияКлиентСервер.СообщитьПользователю("для заполнения данных каледаря, необходимо его записать");
		Возврат;
	КонецЕсли;	
	ПолучитьДанныеКалендаряНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеКалендаряНаСервере()
	Если Год=0 Тогда
		итWMSОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните год");
		Возврат;
	КонецЕсли;
	СервисПолученияДанных=Объект.СервисПолученияДанных;
	Если Объект.СервисПолученияДанных.ПроизвольныйСервис Тогда
		СтрокаСоединения=СервисПолученияДанных.ПроизвольнаяСтрокаПодключения;
	иначе
		СтрокаСоединения=СервисПолученияДанных.IPАдресСервера+"/"+СервисПолученияДанных.ИмяПубликацииБазы;
	КонецЕсли;
	
	Порт=?(СервисПолученияДанных.ПортHttpСервиса=0,Неопределено,СервисПолученияДанных.ПортHttpСервиса);
	Если СервисПолученияДанных.ТребуетсяАутентификация Тогда
   	HttpСоединение=новый HTTPСоединение(СтрокаСоединения,Порт,СервисПолученияДанных.Логин,СервисПолученияДанных.Пароль);
	иначе
	HttpСоединение=новый HTTPСоединение(СтрокаСоединения,Порт);	
	КонецЕсли;
	ДанныеАвторизации=Base64Строка(ПолучитьДвоичныеДанныеИзСтроки("webserv:111"));
	Запрос = Новый HTTPЗапрос("/hs/"+СервисПолученияДанных.URLПространствоСервиса+"/"+СервисПолученияДанных.ИмяОперации+"/"+СтрЗаменить(Строка(Год),Символы.НПП,""));
	Запрос.Заголовки.Вставить("Authorization","Basic "+ДанныеАвторизации);
	Результат=HttpСоединение.Получить(Запрос);
	Данные=Результат.ПолучитьТелоКакСтроку();
	ТаблицаКалендаря=итWMSСлужебныеПроцедурыИФункции.ДесериализаторДанных(Данные);
	Для Каждого стр из ТаблицаКалендаря Цикл 
	МенеджерЗаписи=РегистрыСведений.ДанныеПроизводственногоКалендаря.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата=стр.ДатаКалендаря;
	МенеджерЗаписи.Год=стр.год;
	МенеджерЗаписи.ПроизводственныйКалендарь=Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Дата=стр.ДатаКалендаря;
	МенеджерЗаписи.Год=стр.год;
	МенеджерЗаписи.ПроизводственныйКалендарь=Объект.Ссылка;
    МенеджерЗаписи.ВидДня=стр.ВидДня;
	МенеджерЗаписи.Записать();
	КонецЦикла;
КонецПроцедуры
